netify-soap/src/test/resources/soap/requests/genre/UpdateGenreRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://duo.nl/namespace/netify/general"
                  xmlns:gen1="http://duo.nl/namespace/netify/datatypes/genre">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:UpdateGenreRequest>
            <gen:genre>
                <!--Optional:-->
                <gen1:id>35</gen1:id>
                <gen1:name>Comedy</gen1:name>
            </gen:genre>
        </gen:UpdateGenreRequest>
    </soapenv:Body>
</soapenv:Envelope>